saasclawai-org/quartz/firmware/sdkconfig.defaults
# Quartz ESP32 Firmware — sdkconfig defaults
# Target: ESP32-S3 (LilyGO T-Display S3)

# === Chip ===
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# === Flash & Partition ===
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM (T-Display S3 has 8MB PSRAM — used for AES mining scratchpad)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=n
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEM_ALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=n

# === Partition Table ===
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# === Flash Encryption (Hardware Wallet Security) ===
CONFIG_SECURE_FLASH_ENC_ENABLED=y
CONFIG_SECURE_FLASH_ENCRYPTION_MODE_AES_256=y
CONFIG_SECURE_FLASH_REQUIRE_ALREADY_ENABLED=n
CONFIG_SECURE_FLASH_UART_BOOTLOADER_ALLOW_ENC=n
CONFIG_SECURE_FLASH_UART_BOOTLOADER_ALLOW_DEC=n
CONFIG_SECURE_FLASH_UART_BOOTLOADER_ALLOW_CACHE=n

# === Secure Boot ===
CONFIG_SECURE_BOOT=y
CONFIG_SECURE_BOOT_V2_ENABLED=y
CONFIG_SECURE_BOOT_BUILD_SIGNED_BINARIES=y

# === NVS (encrypted) ===
CONFIG_NVS_ENCRYPTION=y

# === FreeRTOS ===
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_ENABLE_TICKLESS=y

# === BLE (NimBLE — much smaller than Bluedroid) ===
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
# Device name shown in BLE scanning
CONFIG_BT_NIMBLE_DEVICE_NAME="Quartz Miner"

# === WiFi (P2P networking) ===
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_MODE_STA=y
CONFIG_ESP_WIFI_NVS_ENABLED=y

# === Logging ===
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# === mbedTLS (SHA-256 for CrystalHash) ===
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_HARDWARE_MPI=y

# === SPI (TFT display) ===
CONFIG_SPIRAM_SPIWORKAROUND=y

# === Temperature sensor ===
CONFIG_TEMP_SENS=y
